In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import rand

In [3]:
np.random.seed(101) # to see the same random number from the tutorial

In [7]:
df = pd.DataFrame(rand(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [8]:
df

          W         X         Y         Z
A  0.097146  0.102847  0.701507  0.890480
B  0.159560  0.275573  0.672492  0.164303
C  0.701371  0.487635  0.680678  0.521548
D  0.043397  0.223937  0.575205  0.120434
E  0.500117  0.138010  0.052808  0.178277

# Each of columns in data frame is actually just a pandas series and they all share a common index

In [11]:
df['W'] #to get the column name, it return a panda series

A    0.097146
B    0.159560
C    0.701371
D    0.043397
E    0.500117
Name: W, dtype: float64

In [10]:
type(df['W'])

pandas.core.series.Series

In [13]:
df[['W','Z']] # asking for a multiple columns return a data frame

          W         Z
A  0.097146  0.890480
B  0.159560  0.164303
C  0.701371  0.521548
D  0.043397  0.120434
E  0.500117  0.178277

In [14]:
#new column

df['new']= df['W']+ df['Y']

In [15]:
df

          W         X         Y         Z       new
A  0.097146  0.102847  0.701507  0.890480  0.798654
B  0.159560  0.275573  0.672492  0.164303  0.832052
C  0.701371  0.487635  0.680678  0.521548  1.382049
D  0.043397  0.223937  0.575205  0.120434  0.618602
E  0.500117  0.138010  0.052808  0.178277  0.552925

In [17]:
# removing column

df.drop('new', axis=1)

          W         X         Y         Z
A  0.097146  0.102847  0.701507  0.890480
B  0.159560  0.275573  0.672492  0.164303
C  0.701371  0.487635  0.680678  0.521548
D  0.043397  0.223937  0.575205  0.120434
E  0.500117  0.138010  0.052808  0.178277

In [18]:
df

          W         X         Y         Z       new
A  0.097146  0.102847  0.701507  0.890480  0.798654
B  0.159560  0.275573  0.672492  0.164303  0.832052
C  0.701371  0.487635  0.680678  0.521548  1.382049
D  0.043397  0.223937  0.575205  0.120434  0.618602
E  0.500117  0.138010  0.052808  0.178277  0.552925

In [19]:
# df.drop doestn't remove the column from original data frame

In [20]:
#that's why inplace= True need to be added

In [21]:
df.drop('new', axis=1, inplace=True)

In [22]:
df

          W         X         Y         Z
A  0.097146  0.102847  0.701507  0.890480
B  0.159560  0.275573  0.672492  0.164303
C  0.701371  0.487635  0.680678  0.521548
D  0.043397  0.223937  0.575205  0.120434
E  0.500117  0.138010  0.052808  0.178277

In [23]:
# to drop rows

In [24]:
df.drop('E')

          W         X         Y         Z
A  0.097146  0.102847  0.701507  0.890480
B  0.159560  0.275573  0.672492  0.164303
C  0.701371  0.487635  0.680678  0.521548
D  0.043397  0.223937  0.575205  0.120434

In [25]:
df

          W         X         Y         Z
A  0.097146  0.102847  0.701507  0.890480
B  0.159560  0.275573  0.672492  0.164303
C  0.701371  0.487635  0.680678  0.521548
D  0.043397  0.223937  0.575205  0.120434
E  0.500117  0.138010  0.052808  0.178277

In [26]:
#again YOU have to USE INPLACE = TRUE for PARMANENTLY delete anything

In [27]:
df.shape

(5, 4)

In [30]:
#selecing rows. There are two methods

In [29]:
df.loc['A']

W    0.097146
X    0.102847
Y    0.701507
Z    0.890480
Name: A, dtype: float64

In [34]:
#second method

df.iloc[2]

W    0.701371
X    0.487635
Y    0.680678
Z    0.521548
Name: C, dtype: float64

#subset of rows and columns

In [35]:
df.loc['B','Y']

0.6724915296568056

In [37]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.097146  0.701507
B  0.159560  0.672492